test/request-response-samples/Create__esim/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:cai3g="http://schemas.ericsson.com/cai3g1.2/" xmlns:ns="http://schemas.ericsson.com/ma/ESIM/" xmlns:esim="http://schemas.ericsson.com/ma/ESIM/" xmlns:jaxws="http://java.sun.com/xml/ns/jaxws"><soap:Body><cai3g:Create xmlns:cai3g="http://schemas.ericsson.com/cai3g1.2/" xmlns="http://schemas.ericsson.com/cai3g1.2/"><cai3g:MOType>ESIMSubscription@http://schemas.ericsson.com/ma/ESIM/</cai3g:MOType><cai3g:MOId><esim:imsi xmlns:esim="http://schemas.ericsson.com/ma/ESIM/">12345678</esim:imsi><esim:msisdn xmlns:esim="http://schemas.ericsson.com/ma/ESIM/">987654321</esim:msisdn></cai3g:MOId><cai3g:MOAttributes><esim:CreateESIMSubscription imsi="12345678" msisdn="987654321" xmlns:esim="http://schemas.ericsson.com/ma/ESIM/"><esim:imsi>12345678</esim:imsi><esim:msisdn>987654321</esim:msisdn><esim:primaryImsi>12345678</esim:primaryImsi><esim:primaryMsisdn>987654321</esim:primaryMsisdn><esim:primaryESIMDomain>primary</esim:primaryESIMDomain><esim:secondaryESIMDomain>secondary</esim:secondaryESIMDomain></esim:CreateESIMSubscription></cai3g:MOAttributes></cai3g:Create></soap:Body></soap:Envelope>